# GetCurrentPlanarRefID

## Description
Return the current plane ref ID. This could be any plane: a working plane, screen plane (0), ground plane of a container, or any arbitrary plane.

```pascal
FUNCTION GetCurrentPlanarRefID : LONGINT;
```

```python

def vs.GetCurrentPlanarRefID():
    return LONGINT
```

## Version
Availability: from Vectorworks 2011
## Category
* Document Settings